'''
Билет на одну поездку в метро стоит 15 рублей,
билет на 5 поездок стоит 70 рублей,
билет на 10 поездок стоит 125 рублей,
билет на 20 поездок стоит 230 рублей,
билет на 60 поездок стоит 440 рублей.

Выведите пять целых чисел, равные необходимому количеству билетов на 1, на 5, на 10, на 20, на 60 поездок.
'''

n = int(input())

Summa = 0

count_60 = 0 # 7.33 рублей за 1 поездку
count_20 = 0 # 11.5 рублей за 1 поездку
count_10 = 0 # 12.5 рублей за 1 поездку
count_5 = 0 # 14 рублей за 1 поездку
count_1 = 0 # 15 рурублейбля за 1 поездку

while n>=36:
    n -= 60
    Summa += 440
    count_60 += 1
while n>=18:
    n -= 20
    Summa += 230
    count_20 += 1
while n >= 9:
    n -= 10
    Summa += 125
    count_10 += 1
while n >= 5:
    n -= 5
    Summa += 70
    count_5 += 1
while n >= 1:
    n -= 1
    Summa += 15
    count_1 += 1

print(count_1, count_5, count_10, count_20, count_60)